### Data Transformation

##### Here we are going to generate o group data so we'll make clustering by different groups.

In [4]:
import pandas as pd
from datetime import datetime

In [2]:
df_main = pd.read_csv("../data/original/marketing_campaign.csv", sep="\t", header=0)
df_main.head()

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,635,...,7,0,0,0,0,0,0,3,11,1
1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,11,...,5,0,0,0,0,0,0,3,11,0
2,4141,1965,Graduation,Together,71613.0,0,0,21-08-2013,26,426,...,4,0,0,0,0,0,0,3,11,0
3,6182,1984,Graduation,Together,26646.0,1,0,10-02-2014,26,11,...,6,0,0,0,0,0,0,3,11,0
4,5324,1981,PhD,Married,58293.0,1,0,19-01-2014,94,173,...,5,0,0,0,0,0,0,3,11,0

First we are going to separate to answer "Who is the client?"

In [17]:
age = datetime.now().year - df_main["Year_Birth"]
df_customer_profile = df_main[
    ["ID", "Education", "Marital_Status", "Kidhome", "Teenhome", "Income"]
].assign(Age=age)
df_customer_profile_encoded = pd.get_dummies(
    df_customer_profile,
    columns=["Education", "Marital_Status"],
    drop_first=True
)
df_customer_profile_encoded.to_csv("../data/processed/customer_profile.csv", index=False)
df_customer_profile_encoded.head()

,ID,Kidhome,Teenhome,Income,Age,Education_Basic,Education_Graduation,Education_Master,Education_PhD,Marital_Status_Alone,Marital_Status_Divorced,Marital_Status_Married,Marital_Status_Single,Marital_Status_Together,Marital_Status_Widow,Marital_Status_YOLO
0,5524,0,0,58138.0,68,False,True,False,False,False,False,False,True,False,False,False
1,2174,1,1,46344.0,71,False,True,False,False,False,False,False,True,False,False,False
2,4141,0,0,71613.0,60,False,True,False,False,False,False,False,False,True,False,False
3,6182,1,0,26646.0,41,False,True,False,False,False,False,False,False,True,False,False
4,5324,1,0,58293.0,44,False,False,False,True,False,False,True,False,False,False,False

Now we are going to separate to identify "How the client makes his purchase?"

In [12]:
df_purchases = df_main[["NumWebPurchases", "NumCatalogPurchases", "NumStorePurchases", "NumWebVisitsMonth"]]
df_purchases.to_csv("../data/processed/purchases.csv", index=False)
df_purchases.head()

   NumWebPurchases  NumCatalogPurchases  NumStorePurchases  NumWebVisitsMonth
0                8                   10                  4                  7
1                1                    1                  2                  5
2                8                    2                 10                  4
3                2                    0                  4                  6
4                5                    3                  6                  5

Here we are going to identify "How the client reacts to marketing campaings?"

In [19]:
AcceptedCmp_Total = df_main[
    ['AcceptedCmp1','AcceptedCmp2','AcceptedCmp3',
     'AcceptedCmp4','AcceptedCmp5']
].sum(axis=1)
df_marketing_response = df_main[
    ["NumDealsPurchases", "Response"]
].assign(AcceptedCmp_Total=AcceptedCmp_Total)
df_marketing_response.head()
df_marketing_response.to_csv("../data/processed/marketing_response.csv", index=False)

And finally we are going to group to answer "Which is the behavior of the client?"

In [20]:
total_spending = df_main[
    [ "MntWines", "MntFruits", "MntMeatProducts",
    "MntFishProducts", "MntSweetProducts", "MntGoldProds"]
].sum(axis=1)
df_purchase_behavior = df_main[
    ["Recency",  "MntWines", "MntFruits", "MntMeatProducts",
    "MntFishProducts", "MntSweetProducts", "MntGoldProds"]
].assign(Total_Spending=total_spending)
df_purchase_behavior.head()
df_purchase_behavior.to_csv("../data/processed/purchase_behavior.csv", index=False)